lib/uglifyjs/README.html

<div id="outline-container-1_2" class="outline-3">
<h3 id="sec-1_2"><span class="section-number-3">1.2</span> Usage </h3>
<div class="outline-text-3" id="text-1_2">


<p>
There is a helper script now &mdash; <code>bin/uglifyjs</code> &mdash; that uses the library to
compress a script using the maximum compression settings.  Synopsis:
</p>



<pre class="src src-sh">uglifyjs [ options... ] [ filename ]
</pre>



<p>
<code>filename</code> should be the last argument and should name the file from which
to read the JavaScript code.  If you don't specify it, it will read code
from STDIN.
</p>
<p>
Supported options:
</p>
<ul>
<li>
<code>-b</code> or <code>--beautify</code> &mdash; output indented code; when passed, additional
options control the beautifier:

<ul>
<li>
<code>-i N</code> or <code>--indent N</code> &mdash; indentation level (number of spaces)

</li>
<li>
<code>-q</code> or <code>--quote-keys</code> &mdash; quote keys in literal objects (by default,
only keys that cannot be identifier names will be quotes).

</li>
</ul>
</li>
<li>
<code>--ascii</code> &mdash; pass this argument to encode non-ASCII characters as
<code>\uXXXX</code> sequences.  By default UglifyJS won't bother to do it and will
output Unicode characters instead.  (the output is always encoded in UTF8,
but if you pass this option you'll only get ASCII).

</li>
<li>
<code>-nm</code> or <code>--no-mangle</code> &mdash; don't mangle variable names

</li>
<li>
<code>-ns</code> or <code>--no-squeeze</code> &mdash; don't call <code>ast_squeeze()</code> (which does various
optimizations that result in smaller, less readable code).

</li>
<li>
<code>-mt</code> or <code>--mangle-toplevel</code> &mdash; mangle names in the toplevel scope too
(by default we don't do this).

</li>
<li>
<code>--no-seqs</code> &mdash; when <code>ast_squeeze()</code> is called (thus, unless you pass
<code>--no-squeeze</code>) it will reduce consecutive statements in blocks into a
sequence.  For example, "a = 10; b = 20; foo();" will be written as
"a=10,b=20,foo();".  In various occasions, this allows us to discard the
block brackets (since the block becomes a single statement).  This is ON
by default because it seems safe and saves a few hundred bytes on some
libs that I tested it on, but pass <code>--no-seqs</code> to disable it.

</li>
<li>
<code>--no-dead-code</code> &mdash; by default, UglifyJS will remove code that is
obviously unreachable (code that follows a <code>return</code>, <code>throw</code>, <code>break</code> or
<code>continue</code> statement and is not a function/variable declaration).  Pass
this option to disable this optimization.

</li>
<li>
<code>-nc</code> or <code>--no-copyright</code> &mdash; by default, <code>uglifyjs</code> will keep the initial
comment tokens in the generated code (assumed to be copyright information
etc.).  If you pass this it will discard it.

</li>
<li>
<code>-o filename</code> or <code>--output filename</code> &mdash; put the result in <code>filename</code>.  If
this isn't given, the result goes to standard output (or see next one).

</li>
<li>
<code>--overwrite</code> &mdash; if the code is read from a file (not from STDIN) and you
pass <code>--overwrite</code> then the output will be written in the same file.

</li>
<li>
<code>--ast</code> &mdash; pass this if you want to get the Abstract Syntax Tree instead
of JavaScript as output.  Useful for debugging or learning more about the
internals.

</li>
<li>
<code>-v</code> or <code>--verbose</code> &mdash; output some notes on STDERR (for now just how long
each operation takes).

</li>
<li>
<code>--extra</code> &mdash; enable additional optimizations that have not yet been
extensively tested.  These might, or might not, break your code.  If you
find a bug using this option, please report a test case.

</li>
<li>
<code>--unsafe</code> &mdash; enable other additional optimizations that are known to be
unsafe in some contrived situations, but could still be generally useful.
For now only this:

<ul>
<li>
foo.toString()  ==&gt;  foo+""

</li>
</ul>
</li>
<li>
<code>--max-line-len</code> (default 32K characters) &mdash; add a newline after around
32K characters.  I've seen both FF and Chrome croak when all the code was
on a single line of around 670K.  Pass &ndash;max-line-len 0 to disable this
safety feature.

</li>
<li>
<code>--reserved-names</code> &mdash; some libraries rely on certain names to be used, as
pointed out in issue #92 and #81, so this option allow you to exclude such
names from the mangler.  For example, to keep names <code>require</code> and <code>$super</code>
intact you'd specify &ndash;reserved-names "require,$super".
</li>
</ul>



</div>
