lib/uglifyjs/README.html

<div id="outline-container-1_2_1" class="outline-4">
<h4 id="sec-1_2_1"><span class="section-number-4">1.2.1</span> API </h4>
<div class="outline-text-4" id="text-1_2_1">


<p>
Symlink the <b>lib</b> directory as <b>~/.node_libraries/uglifyjs</b>, so that the
<b>require</b> calls in the following sample will work:
</p>



<pre class="src src-espresso"><span style="color: #afeeee; font-weight: bold;">var</span> <span style="color: #40e0d0; font-weight: bold;">jsp</span> = require(<span style="color: #87cefa;">"uglifyjs/parse-js"</span>);
<span style="color: #afeeee; font-weight: bold;">var</span> <span style="color: #40e0d0; font-weight: bold;">pro</span> = require(<span style="color: #87cefa;">"uglifyjs/process"</span>);

<span style="color: #afeeee; font-weight: bold;">var</span> <span style="color: #40e0d0; font-weight: bold;">orig_code</span> = <span style="color: #87cefa;">"... JS code here"</span>;
<span style="color: #afeeee; font-weight: bold;">var</span> <span style="color: #40e0d0; font-weight: bold;">ast</span> = jsp.parse(orig_code); <span style="color: #add8e6;">// </span><span style="color: #add8e6;">parse code and get the initial AST
</span>ast = pro.ast_mangle(ast); <span style="color: #add8e6;">// </span><span style="color: #add8e6;">get a new AST with mangled names
</span>ast = pro.ast_squeeze(ast); <span style="color: #add8e6;">// </span><span style="color: #add8e6;">get an AST with compression optimizations
</span><span style="color: #afeeee; font-weight: bold;">var</span> <span style="color: #40e0d0; font-weight: bold;">final_code</span> = pro.gen_code(ast); <span style="color: #add8e6;">// </span><span style="color: #add8e6;">compressed code here
</span></pre>



<p>
The above performs the full compression that is possible right now.  As you
can see, there are a sequence of steps which you can apply.  For example if
you want compressed output but for some reason you don't want to mangle
variable names, you would simply skip the line that calls
<code>pro.ast_mangle(ast)</code>.
</p>
<p>
Some of these functions take optional arguments.  Here's a description:
</p>
<ul>
<li>
<code>jsp.parse(code, strict_semicolons)</code> &ndash; parses JS code and returns an AST.
<code>strict_semicolons</code> is optional and defaults to <code>false</code>.  If you pass
<code>true</code> then the parser will throw an error when it expects a semicolon and
it doesn't find it.  For most JS code you don't want that, but it's useful
if you want to strictly sanitize your code.

</li>
<li>
<code>pro.ast_mangle(ast, options)</code> &ndash; generates a new AST containing mangled
(compressed) variable and function names.  It supports the following
options:

<ul>
<li>
<code>toplevel</code> &ndash; mangle toplevel names (by default we don't touch them).
</li>
<li>
<code>except</code> &ndash; an array of names to exclude from compression.

</li>
</ul>
</li>
<li>
<code>pro.ast_squeeze(ast, options)</code> &ndash; employs further optimizations designed
to reduce the size of the code that <code>gen_code</code> would generate from the
AST.  Returns a new AST.  <code>options</code> can be a hash; the supported options
are:

<ul>
<li>
<code>make_seqs</code> (default true) which will cause consecutive statements in a
block to be merged using the "sequence" (comma) operator

</li>
<li>
<code>dead_code</code> (default true) which will remove unreachable code.

</li>
</ul>
</li>
<li>
<code>pro.gen_code(ast, options)</code> &ndash; generates JS code from the AST.  By
default it's minified, but using the <code>options</code> argument you can get nicely
formatted output.  <code>options</code> is, well, optional :-) and if you pass it it
must be an object and supports the following properties (below you can see
the default values):

<ul>
<li>
<code>beautify: false</code> &ndash; pass <code>true</code> if you want indented output
</li>
<li>
<code>indent_start: 0</code> (only applies when <code>beautify</code> is <code>true</code>) &ndash; initial
indentation in spaces
</li>
<li>
<code>indent_level: 4</code> (only applies when <code>beautify</code> is <code>true</code>) --
indentation level, in spaces (pass an even number)
</li>
<li>
<code>quote_keys: false</code> &ndash; if you pass <code>true</code> it will quote all keys in
literal objects
</li>
<li>
<code>space_colon: false</code> (only applies when <code>beautify</code> is <code>true</code>) &ndash; wether
to put a space before the colon in object literals
</li>
<li>
<code>ascii_only: false</code> &ndash; pass <code>true</code> if you want to encode non-ASCII
characters as <code>\uXXXX</code>.
</li>
</ul>
</li>
</ul>


</div>

</div>

<div id="outline-container-1_2_2" class="outline-4">
<h4 id="sec-1_2_2"><span class="section-number-4">1.2.2</span> Beautifier shortcoming &ndash; no more comments </h4>
<div class="outline-text-4" id="text-1_2_2">


<p>
The beautifier can be used as a general purpose indentation tool.  It's
useful when you want to make a minified file readable.  One limitation,
though, is that it discards all comments, so you don't really want to use it
to reformat your code, unless you don't have, or don't care about, comments.
</p>
<p>
In fact it's not the beautifier who discards comments &mdash; they are dumped at
the parsing stage, when we build the initial AST.  Comments don't really
make sense in the AST, and while we could add nodes for them, it would be
inconvenient because we'd have to add special rules to ignore them at all
the processing stages.
</p>
</div>
</div>

</div>

<div id="outline-container-1_3" class="outline-3">
<h3 id="sec-1_3"><span class="section-number-3">1.3</span> Compression &ndash; how good is it? </h3>
<div class="outline-text-3" id="text-1_3">


<p>
(XXX: this is somewhat outdated.  On the jQuery source code we beat Closure
by 168 bytes (560 after gzip) and by many seconds.)
</p>
<p>
There are a few popular JS minifiers nowadays &ndash; the two most well known
being the GoogleClosure (GCL) compiler and the YUI compressor.  For some
reason they are both written in Java.  I didn't really hope to beat any of
them, but finally I did &ndash; UglifyJS compresses better than the YUI
compressor, and safer than GoogleClosure.
</p>
<p>
I tested it on two big libraries.  <a href="http://www.dynarchlib.com/">DynarchLIB</a> is my own, and it's big enough
to contain probably all the JavaScript tricks known to mankind.  <a href="http://jquery.com/">jQuery</a> is
definitely the most popular JavaScript library (to some people, it's a
synonym to JavaScript itself).
</p>
<p>
I cannot swear that there are no bugs in the generated codes, but they
appear to work fine.
</p>
<p>
Compression results:
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption></caption>
<colgroup><col align="left" /><col align="right" /><col align="right" /><col align="left" /><col align="left" />
</colgroup>
<thead>
<tr><th scope="col">Library</th><th scope="col">Orig. size</th><th scope="col">UglifyJS</th><th scope="col">YUI</th><th scope="col">GCL</th></tr>
</thead>
<tbody>
<tr><td>DynarchLIB</td><td>636896</td><td>241441</td><td>246452 (+5011)</td><td>240439 (-1002) (buggy)</td></tr>
<tr><td>jQuery</td><td>163855</td><td>72006</td><td>79702  (+7696)</td><td>71858   (-148)</td></tr>
</tbody>
</table>


<p>
UglifyJS is the fastest to run.  On my laptop UglifyJS takes 1.35s for
DynarchLIB, while YUI takes 2.7s and GCL takes 6.5s.
</p>
<p>
GoogleClosure does a lot of smart ass optimizations.  I had to strive really
hard to get close to it.  It should be possible to even beat it, but then
again, GCL has a gazillion lines of code and runs terribly slow, so I'm not
sure it worths spending the effort to save a few bytes.  Also, GCL doesn't
cope with <code>eval()</code> or <code>with{}</code> &ndash; it just dumps a warning and proceeds to
mangle names anyway; my DynarchLIB compiled with it is buggy because of
this.
</p>
<p>
UglifyJS consists of ~1100 lines of code for the tokenizer/parser, and ~1100
lines for the compressor and code generator.  That should make it very
maintainable and easily extensible, so I would say it has a good place in
this field and it's bound to become the de-facto standard JS minifier.  And
I shall rule the world. :-) Use it, and <b>spread the word</b>!
</p>
</div>

</div>
